EDT/УТ/src/InformationRegisters/зпТарификацияЗППоЗаказам/зпТарификацияЗППоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зпТарификацияЗППоЗаказам</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СхемаРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпСхемыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпТарифыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеНачисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставЭкипажа</name>
    <type>
      <types>EnumRef.зпСоставЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияЗаказа</name>
    <type>
      <types>CatalogRef.зпКатегорииЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.зпЗоныДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/зпИсходныеДанныеРасчетаЗППоЗаказам/зпИсходныеДанныеРасчетаЗППоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>зпИсходныеДанныеРасчетаЗППоЗаказам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КатегорияЗаказа</name>
    <type>
      <types>CatalogRef.зпКатегорииЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.зпЗоныДоставки</types>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияЗаказа</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>ПолигонМаршрутизацииЗаказа</name>
    <type>
      <types>CatalogRef.ПолигоныМаршрутизации</types>
    </type>
  </resources>
  <resources>
    <name>ПолигонМаршрутизацииСоСложнойПарковкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРасчетаЗП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПричинаНевыполненияДоставки</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </resources>
  <resources>
    <name>Начисление</name>
    <type>
      <types>CatalogRef.зпНачисления</types>
    </type>
  </resources>
  <attributes>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпТарифыРасчетаЗП</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СхемаРасчетаЗП</name>
    <type>
      <types>CatalogRef.зпСхемыРасчетаЗП</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРасчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.зпВидыЗанятости</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставЭкипажа</name>
    <type>
      <types>EnumRef.зпСоставЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/зпТарификацияЗППоЗаказам/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекОтбор = ЭтотОбъект.Отбор;
	Если ТекОтбор.СхемаРасчетаЗП.Использование Тогда
		СхемаРасчетаЗП = ТекОтбор.СхемаРасчетаЗП.Значение;
		СхемаРазрешена = СхемаРасчетаЗП.РазрешитьРедактирование Или зпРаботаСРасчетомЗарплатыСервер.НетЗаписиВРегистре("РегистрСведений.зпИсходныеДанныеРасчетаЗППоЗаказам", "СхемаРасчетаЗП", СхемаРасчетаЗП);
	Иначе
		СхемаРазрешена = Истина;
	КонецЕсли;
	Если ТекОтбор.ТарифРасчетаЗП.Использование Тогда
		ТарифРасчетаЗП = ТекОтбор.ТарифРасчетаЗП.Значение;
		ТарифРазрешен = ТарифРасчетаЗП.РазрешитьРедактирование Или зпРаботаСРасчетомЗарплатыСервер.НетЗаписиВРегистре("РегистрСведений.зпИсходныеДанныеРасчетаЗППоЗаказам", "ТарифРасчетаЗП", ТарифРасчетаЗП);
	Иначе
		ТарифРазрешен = Истина;
	КонецЕсли;
	
	Если Не (СхемаРазрешена И ТарифРазрешен) Тогда
		Отказ = Истина;
		Сообщить("Редактирование запрещено");
		Если Не СхемаРазрешена Тогда
			Сообщить("Обнаружены данные по Схеме расчета!");
		КонецЕсли;
		Если Не ТарифРазрешен Тогда
			Сообщить("Обнаружены данные по Тарифу расчета!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
